AWSCloudTrail | where EventName in ('CreateAccessKey', 'CreateUser', 'AttachUserPolicy', 'PutUserPolicy') | where RequestParameters contains 'Admin' or RequestParameters contains '*' | extend TimeDiff = datetime_diff('minute', TimeGenerated, prev(TimeGenerated)) | where TimeDiff <= 8 | summarize Events = make_list(EventName), TimeSpan = max(TimeGenerated) - min(TimeGenerated) by SourceIPAddress, UserIdentityArn | where array_length(Events) >= 3 and TimeSpan <= 8m