AWSCloudTrail | where EventName in ('GetObject', 'ListObjects', 'ListBucket') | where RequestParameters contains '.aws' or RequestParameters contains 'credentials' or RequestParameters contains 'config' | where SourceIPAddress !startswith '10.' and SourceIPAddress !startswith '172.' and SourceIPAddress !startswith '192.168.' | summarize count() by SourceIPAddress, UserIdentityType, bin(TimeGenerated, 5m) | where count_ > 10