AWSCloudTrail | where EventName == 'AssumeRole' | where ErrorCode == '' | extend TargetAccount = extract('arn:aws:iam::([0-9]+):', 1, tostring(ResponseElements)) | extend SourceAccount = extract('arn:aws:iam::([0-9]+):', 1, tostring(UserIdentity_arn)) | where TargetAccount != SourceAccount | summarize CrossAccountAssuptions = count(), UniqueTargetAccounts = dcount(TargetAccount) by SourceIPAddress, UserIdentity_principalId, bin(TimeGenerated, 15m)