AWSCloudTrail | where EventName in ('GetObject', 'CopyObject', 'DownloadDBLogFilePortion') | where RequestParameters contains 'credentials' or RequestParameters contains 'config' or RequestParameters contains 'backup' | summarize DataAccess = count(), UniqueObjects = dcount(RequestParameters) by SourceIPAddress, UserIdentity_principalId, bin(TimeGenerated, 10m) | where DataAccess > 20