AWSCloudTrail | where EventName in ('GetObject', 'ListObjects', 'ListObjectsV2') | where RequestParameters contains '.aws' or RequestParameters contains 'credentials' or RequestParameters contains '.pem' or RequestParameters contains 'key' | where ErrorCode == '' | summarize count() by SourceIPAddress, UserIdentity_principalId, bin(TimeGenerated, 5m) | where count_ > 10