{
  "policy_id": "ca-007-001",
  "display_name": "SOaC GTR-2025: Perimeter Defense Access Controls",
  "description": "Restricts access to web management interfaces and administrative consoles. Enforces MFA and device compliance for all perimeter-facing application management.",
  "state": "enabledForReportingButNotEnforced",
  "conditions": {
    "applications": {"includeApplications": ["Web Server Admin", "IIS Manager", "Azure App Service", "AWS Console"]},
    "users": {"includeGroups": ["Web-Admins", "Platform-Engineers"]},
    "locations": {"includeLocations": ["AllTrusted"]},
    "deviceStates": {"includeStates": ["compliant", "domainJoined"]}
  },
  "grantControls": {
    "operator": "AND",
    "builtInControls": ["mfa", "compliantDevice"]
  },
  "sessionControls": {
    "signInFrequency": {"value": 2, "type": "hours", "isEnabled": true}
  },
  "metadata": {"package_id": "pkg-007", "mitre_defense": ["T1190", "T1078"]}
}
