let WebExploit = W3CIISLog | where TimeGenerated >= ago(7d) | where scStatus == 200 and (csUriQuery contains "../" or csUriQuery contains "union" or csUriQuery contains "<script") | project TimeGenerated, SourceIP=cIP, WebExploitTime=TimeGenerated; let ProcessInject = DeviceProcessEvents | where TimeGenerated >= ago(7d) | where ProcessCommandLine has_any ("CreateRemoteThread", "WriteProcessMemory") | project TimeGenerated, DeviceId, ProcessInjectTime=TimeGenerated; let MetadataAccess = DeviceNetworkEvents | where TimeGenerated >= ago(7d) | where RemoteIP == "169.254.169.254" | project TimeGenerated, DeviceId, MetadataTime=TimeGenerated; WebExploit | join kind=inner ProcessInject on $left.SourceIP == $right.DeviceId | join kind=inner MetadataAccess on DeviceId | where ProcessInjectTime > WebExploitTime and MetadataTime > ProcessInjectTime | where datetime_diff('hour', MetadataTime, WebExploitTime) <= 24